/**
 * 数独求解程序
 * 输入方式，以行为单位，按照 9*9 宫格的方式，每输入一行按下一个回车，空格用 0 表示
 * 例如： 
 * input >
 *	   000003080   		[Enter]
 *     030000090		[Enter]
 * 	   800090003		[Enter]
 *	   000080905		[Enter]
 *	   009007800		[Enter]
 *	   106000000		[Enter]
 *	   600040008		[Enter]
 *	   040000010		[Enter]
 *	   090800000		[Enter]
 * output >
 * 9 1 2    4 5 3    6 8 7
 * 5 3 4    6 7 8    1 9 2
 * 8 6 7    2 9 1    4 5 3  
 *
 * 2 7 3    1 8 4    9 6 5
 * 4 5 9    3 6 7    8 2 1
 * 1 8 6    9 2 5    3 7 4
 *
 * 6 2 1    7 4 9    5 3 8
 * 7 4 8    5 3 6    2 1 9
 * 3 9 5    8 1 2    7 4 6
 */